### DataFrame에서 원소/요소 읽기
- 행 읽기 / 열 읽기
- 행과 열이 교차하는 지점의 원소/요소 읽기

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# 데이터 준비
jumsu=[[98,99,100],[67,72,36]]

In [4]:
# 2D 데이터를 DF로 저장
df1=pd.DataFrame(jumsu)
df1

    0   1    2
0  98  99  100
1  67  72   36

In [6]:
# 행 인덱스와 열 인덱스를 속성으로 지정
# 행인덱스는 => 김경태, 안효준
# 열인덱스 => 음악, 영어, 무용
df1.index=['김경태','안효준']
df1.columns=['음악','영어','무용']
df1

     음악  영어   무용
김경태  98  99  100
안효준  67  72   36

-[열/컬럼 선택] : 변수명[컬럼명/컬럼인덱스]

In [9]:
# 영어 과목 점수만 추출
print(df1['영어'], type(df1['영어']),sep='\n\n')

김경태    99
안효준    72
Name: 영어, dtype: int64

<class 'pandas.core.series.Series'>

In [10]:
# 무용 과목 점수만 추출
df1.무용

김경태    100
안효준     36
Name: 무용, dtype: int64

In [19]:
# 음악, 무용 컬럼 추출
df1[['음악','무용']]

     음악   무용
김경태  98  100
안효준  67   36

In [22]:
# df1['음악':'무용':1]      # ERROR

In [27]:
print(df1.columns, df1.columns[1:], df1.columns[::2],sep='\n')
df1[df1.columns[::2]]

Index(['음악', '영어', '무용'], dtype='object')
Index(['영어', '무용'], dtype='object')
Index(['음악', '무용'], dtype='object')

     음악   무용
김경태  98  100
안효준  67   36

- [행/row 선택] : 변수명.iloc[행인덱스], 변수명.loc[행인덱스]

In [13]:
df1.iloc[0]         # 변수명.iloc[정수인덱스] : i가 integer 라서 정수만 가능

음악     98
영어     99
무용    100
Name: 김경태, dtype: int64

In [16]:
# 변수명.loc[행인덱스]
df1.loc['김경태']   # i 뺴면 가능

음악     98
영어     99
무용    100
Name: 김경태, dtype: int64

In [28]:
# 여러개 행 추출
df1.loc[['안효준','김경태']]

     음악  영어   무용
안효준  67  72   36
김경태  98  99  100

In [31]:
print(df1.index, df1.index[1:], df1.index[::-1])

df1.loc[df1.index[::-1]]

Index(['김경태', '안효준'], dtype='object') Index(['안효준'], dtype='object') Index(['안효준', '김경태'], dtype='object')

     음악  영어   무용
안효준  67  72   36
김경태  98  99  100

- [원소/요소 추출] : 변수명.iloc[정수인덱스][열인덱스] / 변수명.loc[행인덱스][열인덱스]

In [33]:
# 김경태님의 영어 점수만 추출
# df1['김경태,[영어]']       <=== KeyError
df1.loc['김경태']['영어'] , df1.iloc[0]['영어']

(99,
 음악     98
 영어     99
 무용    100
 Name: 김경태, dtype: int64)

In [36]:
df1.loc['김경태']['영어'], df1.iloc[0]['영어'],  # df1.iloc[0][1]

C:\Users\kdp\AppData\Local\Temp\ipykernel_14228\2839690813.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.loc['김경태']['영어'], df1.iloc[0]['영어'], df1.iloc[0][1]

(99, 99, 99)

[원소/요소 추출]
    * 변수명.iloc[정수인덱스,열인덱스] / 변수명.loc[행인덱스,열인덱스]

In [39]:
# 김경태님의 영어 점수 추출
df1.iloc[0,1]  # => iloc[정수인덱스,정수인덱스] :  df1.iloc[0,'영어'] -> ERROR

99

In [40]:
df1.loc['김경태','영어']

99

In [42]:
df1

     음악  영어   무용
김경태  98  99  100
안효준  67  72   36

In [41]:
## [문] 김경태님의 영어,무용 점수 추출
df1.loc['김경태','영어':'무용']

영어     99
무용    100
Name: 김경태, dtype: int64

In [43]:
df1.loc['김경태'][['영어','무용']]

영어     99
무용    100
Name: 김경태, dtype: int64

In [44]:
df1.loc[:,'음악']

김경태    98
안효준    67
Name: 음악, dtype: int64

In [45]:
df1.loc[df1.index,'음악']

김경태    98
안효준    67
Name: 음악, dtype: int64